//**************************************************
//
// Hackathon ( bg.cpp )
// Author  : katsuki mizuki
//
//**************************************************

//==================================================
// インクルード
//==================================================
#include "bg.h"
#include "texture.h"
#include "color.h"
#include "input.h"
#include "utility.h"
#include "rectangle.h"

#include <assert.h>

//==================================================
// 定義
//==================================================
namespace
{
}// namespaceはここまで

//==================================================
// スタティック変数
//==================================================
namespace
{
int	s_idx;	// 背景のインデックス
}// namespaceはここまで

//==================================================
// スタティック関数プロトタイプ宣言
//==================================================
namespace
{
}// namespaceはここまで

//--------------------------------------------------
// 初期化
//--------------------------------------------------
void InitBG(void)
{
	// 矩形の設定
	s_idx = SetRectangle(TEXTURE_NONE);

	D3DXVECTOR3 size = D3DXVECTOR3(SCREEN_WIDTH, SCREEN_HEIGHT, 0.0f);
	D3DXVECTOR3 pos = D3DXVECTOR3(SCREEN_WIDTH * 0.5f, SCREEN_HEIGHT * 0.5f, 0.0f);

	// 矩形の位置の設定
	SetPosRectangle(s_idx, pos, size);

	// 矩形の色の設定
	SetColorRectangle(s_idx, GetColor(COLOR_GRAY));
}

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitBG(void)
{
}

//--------------------------------------------------
// 更新
//--------------------------------------------------
void UpdateBG(void)
{
}

//--------------------------------------------------
// 描画
//--------------------------------------------------
void DrawBG(void)
{
}
