//**************************************************
//
// 3Dゲーム制作 ( main.h )
// Author  : katsuki mizuki
//
//**************************************************
#ifndef _MAIN_H_	// このマクロ定義がされてなかったら
#define _MAIN_H_	// ２重インクルード防止のマクロ定義

//==================================================
// インクルード
//==================================================
#include <windows.h>
#include "d3dx9.h"							// 描画処理に必要
#define  DIRECTINPUT_VERSION	(0x0800)	// ビルド時の警戒対処用マクロ
#include "dinput.h"							// 入力処理に必要
#include "xinput.h"							// ジョイパッド処理に必要
#include "xaudio2.h"						// サウンド処理に必要

//==================================================
// ライブラリのリンク
//==================================================
#pragma comment(lib, "d3d9.lib")	// 描画処理に必要
#pragma comment(lib, "d3dx9.lib")	// [d3d9.lib]の拡張ライブラリ
#pragma comment(lib, "dxguid.lib")	// DirectXコンポーネント(部品)使用に必要
#pragma comment(lib, "winmm.lib")	// システム時刻取得に必要

//==================================================
// 定義
//==================================================
#define SCREEN_WIDTH	(1280)	// ウインドウの幅
#define SCREEN_HEIGHT	(720)	// ウインドウの高さ

//==================================================
// プロトタイプ宣言
//==================================================
//--------------------------------------------------
// 取得
// 返値  : LPDIRECT3DDEVICE9 / デバイス
//--------------------------------------------------
LPDIRECT3DDEVICE9 GetDevice(void);

#endif // !_MAIN_H_
