//**************************************************
// 
// Hackathon ( rectangle3D.h )
// Author  : katsuki mizuki
// 
//**************************************************
#ifndef _RECTANGLE3D_H_	//このマクロ定義がされてなかったら
#define _RECTANGLE3D_H_	//２重インクルード防止のマクロ定義

//==================================================
// インクルード
//==================================================
#include "main.h"
#include "texture.h"

//==================================================
// 定義
//==================================================
#define FVF_VERTEX_3D	(D3DFVF_XYZ | D3DFVF_NORMAL | D3DFVF_DIFFUSE | D3DFVF_TEX1)	// 頂点フォーマット[3D] 位置・法線・カラー・テクスチャ

/*↓ 頂点情報[3D] ↓*/

struct VERTEX_3D
{
	D3DXVECTOR3	pos;	// 頂点座標
	D3DXVECTOR3	nor;	// 法線ベクトル
	D3DCOLOR	col;	// 頂点カラー
	D3DXVECTOR2	tex;	// テクスチャ座標
};

//==================================================
// プロトタイプ宣言
//==================================================
//--------------------------------------------------
// 初期化
//--------------------------------------------------
void InitRectangle3D(void);

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitRectangle3D(void);

//--------------------------------------------------
// 描画
//--------------------------------------------------
void DrawRectangle3D(void);

//--------------------------------------------------
// 設定
// 引数  : TEXTURE inTexture / 列挙型 種類
//--------------------------------------------------
int SetRectangle3D(ETexture inTexture);

//--------------------------------------------------
// 設定 [ テクスチャあり ]
// 引数  : LPDIRECT3DTEXTURE9 pTexture / テクスチャ
//--------------------------------------------------
int SetRectangle3DWithTex(LPDIRECT3DTEXTURE9 pTexture);

//--------------------------------------------------
// 使うのを止める
// 引数  : int inIdx / インデックス
//--------------------------------------------------
void StopUseRectangle3D(int inIdx);

//--------------------------------------------------
// 位置の設定
// 引数1  : int inIdx / インデックス
// 引数2  : D3DXVECTOR3& inPos / 中心の位置
//--------------------------------------------------
void SetPosRectangle3D(int inIdx, const D3DXVECTOR3& inPos);

//--------------------------------------------------
// 向きの設定
// 引数1  : int inIdx / インデックス
// 引数2  : float inRot / 向き
//--------------------------------------------------
void SetRotRectangle3D(int inIdx, float inRot);

//--------------------------------------------------
// サイズの設定
// 引数1  : int inIdx / インデックス
// 引数2  : D3DXVECTOR3& inSize / サイズ
//--------------------------------------------------
void SetSizeRectangle3D(int inIdx, const D3DXVECTOR3& inSize);

//--------------------------------------------------
// 色の設定
// 引数1  : int inIdx / インデックス
// 引数2  : D3DXCOLOR& inColor / 色
//--------------------------------------------------
void SetColorRectangle3D(int inIdx, const D3DXCOLOR& inColor);

//--------------------------------------------------
// テクスチャ座標の設定
// 引数1  : int inIdx / インデックス
// 引数2  : D3DXVECTOR2& inTexU / x = 左端, y = 右端
// 引数3  : D3DXVECTOR2& inTexV / x = 上端, y = 下端
//--------------------------------------------------
void SetTexRectangle3D(int inIdx, const D3DXVECTOR2& inTexU, const D3DXVECTOR2& inTexV);

//--------------------------------------------------
// 描画するかどうか
// 引数1  : int inIdx / インデックス
// 引数2  : bool inDraw / 描画するかどうか
//--------------------------------------------------
void SetDrawRectangle3D(int inIdx, bool inDraw);

//--------------------------------------------------
// 加算合成するかどうか
// 引数1  : int inIdx / インデックス
// 引数2  : bool inAdd / 加算合成するかどうか
//--------------------------------------------------
void SetAddRectangle3D(int inIdx, bool inAdd);

//--------------------------------------------------
// テクスチャの変更
// 引数1  : int inIdx / インデックス
// 引数2  : TEXTURE inTexture / 列挙型 種類
//--------------------------------------------------
void ChangeTextureRectangle3D(int inIdx, ETexture inTexture);

//--------------------------------------------------
// テクスチャの変更 [ テクスチャあり ]
// 引数1  : int inIdx / インデックス
// 引数2  : TEXTURE pTexture / 列挙型 種類
//--------------------------------------------------
void ChangeTextureRectangle3DWithTex(int inIdx, LPDIRECT3DTEXTURE9 pTexture);

//--------------------------------------------------
// 頂点バッファの取得
// 引数  : int inIdx / インデックス
// 返値  : LPDIRECT3DVERTEXBUFFER9 / 頂点バッファ
//--------------------------------------------------
LPDIRECT3DVERTEXBUFFER9 GetVtxBuffRectangle3D(int inIdx);

#endif // !_RECTANGLE3D_H_
